sterentev/atdf-device-asm-include/inc/ATtiny861A.inc
; ----------	Register TCCR1C bits		------------------------
.equ	COM1A1S		= 7		; 0x80 - COM1A1 Shadow Bit
.equ	COM1A0S		= 6		; 0x40 - COM1A0 Shadow Bit
.equ	COM1B1S		= 5		; 0x20 - COM1B1 Shadow Bit
.equ	COM1B0S		= 4		; 0x10 - COM1B0 Shadow Bit
.equ	COM1D_MASK	= 0x0C		;      - Comparator D output mode (2 bits)
.equ	COM1D0		= 2		;          COM1D BIT0 position
.equ	FOC1D		= 1		; 0x02 - Force Output Compare Match 1D
.equ	PWM1D		= 0		; 0x01 - Pulse Width Modulator D Enable

; ----------	Register TCCR1D bits		------------------------
.equ	FPIE1		= 7		; 0x80 - Fault Protection Interrupt Enable
.equ	FPEN1		= 6		; 0x40 - Fault Protection Mode Enable
.equ	FPNC1		= 5		; 0x20 - Fault Protection Noise Canceler
.equ	FPES1		= 4		; 0x10 - Fault Protection Edge Select
.equ	FPAC1		= 3		; 0x08 - Fault Protection Analog Comparator Enable
.equ	FPF1		= 2		; 0x04 - Fault Protection Interrupt Flag
.equ	WGM1_MASK	= 0x03		;      - Waveform Generation Mode Bit (2 bits)
.equ	WGM10		= 0		;          WGM1 BIT0 position
; ::::  WGM1	:::: bitfield values
;			0x00		; Fast PWM (NB! PWMx must be set!)
;			0x01		; Phase and Frequency Correct PWM
;			0x02		; PWM6/Single-slope
;			0x03		; PWM6/Dual-slope

; ----------	Register TCCR1E bits		------------------------
.equ	OC1OE_MASK	= 0x3F		;      - Output Compare Override Enable Bits (6 bits)
.equ	OC1OE0		= 0		;          OC1OE BIT0 position

; ----------	Register TIMSK bits		------------------------
.equ	OCIE1D		= 7		; 0x80 - OCIE1D: Timer/Counter1 Output Compare Interrupt Enable
.equ	OCIE1A		= 6		; 0x40 - OCIE1A: Timer/Counter1 Output Compare Interrupt Enable
.equ	OCIE1B		= 5		; 0x20 - OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable
.equ	TOIE1		= 2		; 0x04 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR bits		------------------------
.equ	OCF1D		= 7		; 0x80 - Timer/Counter1 Output Compare Flag 1D
.equ	OCF1A		= 6		; 0x40 - Timer/Counter1 Output Compare Flag 1A
.equ	OCF1B		= 5		; 0x20 - Timer/Counter1 Output Compare Flag 1B
.equ	TOV1		= 2		; 0x04 - Timer/Counter1 Overflow Flag

; ----------	Register DT1 bits		------------------------
.equ	DT1H_MASK	= 0xF0		;      -  (4 bits)
.equ	DT1H0		= 4		;          DT1H BIT0 position
.equ	DT1L_MASK	= 0x0F		;      -  (4 bits)
.equ	DT1L0		= 0		;          DT1L BIT0 position



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	CTPB		= 4		; 0x10 - Clear temporary page buffer
.equ	RFLB		= 3		; 0x08 - Read fuse and lock bits
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register MCUCR bits		------------------------
.equ	ISC01		= 1		; 0x02 - Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register GIMSK bits		------------------------
.equ	INT_MASK	= 0xC0		;      - External Interrupt Request 1 Enable (2 bits)
.equ	INT0		= 6		;          INT BIT0 position
.equ	PCIE_MASK	= 0x30		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 4		;          PCIE BIT0 position

; ----------	Register GIFR bits		------------------------
.equ	INTF_MASK	= 0xC0		;      - External Interrupt Flags (2 bits)
.equ	INTF0		= 6		;          INTF BIT0 position
.equ	PCIF		= 5		; 0x20 - Pin Change Interrupt Flag



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register PRR bits		------------------------
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 2		; 0x04 - Power Reduction Timer/Counter0
.equ	PRUSI		= 1		; 0x02 - Power Reduction USI
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register MCUCR bits		------------------------
.equ	BODS		= 7		; 0x80 - BOD Sleep
.equ	PUD		= 6		; 0x40 - Pull-up Disable
.equ	SE		= 5		; 0x20 - Sleep Enable
.equ	SM_MASK		= 0x18		;      - Sleep Mode Select Bits (2 bits)
.equ	SM0		= 3		;          SM BIT0 position
.equ	BODSE		= 2		; 0x04 - BOD Sleep Enable
.equ	ISC0_MASK	= 0x03		;      - Interrupt Sense Control 0 bits (2 bits)
;.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x08		; ADC Noise Reduction (If Available)
;			0x10		; Power Down
;			0x18		; Standby
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change in INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-On Reset Flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register PLLCSR bits		------------------------
.equ	LSM		= 7		; 0x80 - Low speed mode
.equ	PCKE		= 2		; 0x04 - PCK Enable
.equ	PLLE		= 1		; 0x02 - PLL Enable
.equ	PLOCK		= 0		; 0x01 - PLL Lock detector




